wale/ReTau300/coarse/method2/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         			backward;
}

gradSchemes
{
    default         			Gauss linear;
}

divSchemes
{
    default         			Gauss linear;
    div(phi,U)      			Gauss linear;
    div(phi,k)      			Gauss limitedLinear 1;
    div(phi,nuTilda) 			Gauss limitedLinear 1;
    div((nuEff*dev2(T(grad(U))))) 	Gauss linear;
}

laplacianSchemes
{
    default         			Gauss linear corrected;
}

interpolationSchemes
{
    default         			linear;
}

snGradSchemes
{
    default         			corrected;
}

fluxRequired
{
    default         			no;
    p               			;
}


// ************************************************************************* //
